package my;
import java.util.ArrayList;

/*
 * Πελάτες της εταιρίας είναι όσοι διαθέτουν εξουσιοδοτημένο συνεργείο αντιπροσωπείας,
 *  οι οποίοι καταχωρούνται στο πελατολόγιο με βάση το συνεργείο που διαθέτουν
 *  και την αντιπροσωπεία που εξυπηρετούν. 
 *  Για κάθε πελάτη-συνεργείο τηρούνται τα παρακάτω στοιχεία:
 *  όνομα συνεργείου, επαγγελματικό ΑΦΜ, διεύθυνση, όνομα υπευθύνου,
 *  τηλέφωνο και λίστα εταιριών που εξυπηρετεί.
 *  Ο πελάτης ζητά να αγοράσει συγκεκριμένα ανταλλακτικά και εφόσον ο αποθηκάριος τα συγκεντρώσει όλα,
 *  πληρώνει και ολοκληρώνεται η διαδικασία.
 */
public class Customer {
	private String Workshop_Name;
	private double AFM;
	private String address; //Τι θέλει; e-mail ή κανονική διεύθυνση;
	private String PartinentName;
	private int phone;// Μπορει και String αν ειναι να βαλουμε κανενα (+30)...
	private ArrayList<String> CoopCompanies;//Αυτο μαλλον θα αναπαρασταθει σαν εξτρα πινακας με ξενο κλειδι το id του Πελατη..
	

	public Customer() {
		// TODO Auto-generated constructor stub
	}

	
	
}
